# RoutingCriterionBase Properties

---
The RoutingCriterionBase type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RoutingCriterionBase Class
Autodesk.Revit.DB Namespace